/* NSButton (Automatically check for updates) : <title:Automatically check for updates> (oid:22) */
"Automatically check for updates" = "Tarkista päivitykset automaattisesti";

/* NSButton (Download) : <title:Download> (oid:7) */
"Download" = "Tuo";

/* NSButton (Later) : <title:Later> (oid:8) */
"Later" = "Myöhemmin";

/* NSTextField (New version available) : <title:New version available> (oid:10) */
"New version available" = "Uusi versio saatavilla";

/* NSWindow (Update) : <title:Update> (oid:5) */
"Update" = "Päivitä";

